# 买水果
Fruits = {
    "苹果": 12.3,  # 水果和单价
    "草莓": 4.5,
    "香蕉": 6.3,
    "葡萄": 5.8,
    "橘子": 6.4,
    "樱桃": 15.8
}
info = {
    "小明": {
        'fruits': {"苹果": 4, "草莓": 13, "香蕉": 10},
        'money': {}
    },
    "小刚": {
        'fruits': {"葡萄": 19, "橘子": 12, "樱桃": 30},
        'money': {}
    }
}
info["小明"]["money"]["苹果"] = str(12.3 * 4)
info["小明"]["money"]["草莓"] = str(4.5 * 13)
info["小明"]["money"]["香蕉"] = str(6.3 * 10)
info["小刚"]["money"]["葡萄"] = str(5.8 * 19)
info["小刚"]["money"]["橘子"] = str(6.4 * 12)
info["小刚"]["money"]["樱桃"] = str(15.8 * 30)
print(info)
